src/Reports/am_БалансСРасшифровкой/am_БалансСРасшифровкой.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>am_БалансСРасшифровкой</name>
  <attributes>
    <name>ЭтоОтчетУНФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

src/AccumulationRegisters/Запасы/Запасы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="91112615-1767-47d9-8493-56f4f6155586">
  <name>Запасы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="f72e33d3-324f-4f94-a330-a919e0f98615">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c7062576-207c-44e8-825d-004e5809e5ae">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="7f9237f1-027e-4670-9ba7-4167ac725dfb">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="74a630ed-a0e3-4e20-874c-32e15365b300">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b2cd2e24-61a2-48a7-b133-f28bf6497017">
    <name>СчетУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3400ef97-0dfb-4ed4-8038-011261a9ace3">
    <name>СтруктурнаяЕдиница</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="2c140d47-2059-4f8f-a235-e3e91129b658">
    <name>ЗаказПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="935b3699-2154-4396-beb4-9d3089189c2c">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/Reports/am_БалансСРасшифровкой/Forms/am_РасшифровкаВРазрезеНоменклатур/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("ДатаОкончания") Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ЗаполнитьНоменклатуру(Параметры.ДатаОкончания, Параметры.Назначение, Параметры.Организация);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНоменклатуру(КонецПериода, Счет, Организация)
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ЗапасыОстаткиИОбороты.Номенклатура КАК Номенклатура,
	               |	СУММА(ЗапасыОстаткиИОбороты.СуммаОборот) КАК Сумма,
	               |	СУММА(ЗапасыОстаткиИОбороты.КоличествоОборот) КАК Количество
	               |ИЗ
	               |	РегистрНакопления.Запасы.ОстаткиИОбороты(
	               |			,
	               |			КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
	               |			Регистратор,
	               |			,
	               |			СчетУчета.Наименование = &Счет
	               |				И Организация = &Организация) КАК ЗапасыОстаткиИОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗапасыОстаткиИОбороты.Организация,
	               |	ЗапасыОстаткиИОбороты.Номенклатура
	               |
	               |ИМЕЮЩИЕ
	               |	(СУММА(ЗапасыОстаткиИОбороты.СуммаОборот) <> 0
	               |		ИЛИ СУММА(ЗапасыОстаткиИОбороты.КоличествоОборот) <> 0)";
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И Организация = &Организация", ""); 
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);	
	Запрос.УстановитьПараметр("Счет", Счет);	
	Если ЗначениеЗаполнено(Организация) ТОгда
		Запрос.УстановитьПараметр("Организация", Организация);	
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество <= 0 и Выборка.Сумма <= 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаРасшифровки = Расшифровка.Добавить();
		
		СтрокаРасшифровки.Номенклатура = Выборка.Номенклатура;
		СтрокаРасшифровки.Сумма = Выборка.Сумма;
		СтрокаРасшифровки.Количество = Выборка.Количество;
		Если ВЫборка.Количество = 0 ТОгда
			СтрокаРасшифровки.Себестоимость = 0;
		Иначе
			СтрокаРасшифровки.Себестоимость = Выборка.Сумма / Выборка.Количество;
		КонецЕсли;
		
		ИтогоКоличество = ИтогоКоличество + Выборка.Количество;
		ИтогоСумма = ИтогоСумма  + Выборка.Сумма;
		ИтогоСебестоимость = ИтогоСебестоимость  + СтрокаРасшифровки.Себестоимость;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.Расшифровка.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(, ТекущиеДанные.Номенклатура);			
	КонецЕсли;
КонецПроцедуры
